# ---------- NFA定义 ----------
# 提问层级：L0(Ipk,Ipi) 入口 | L1(Ia,Ic) 可来自q2等 | L2(Iu) 仅Ia→An或Ic→Co之后 | Is可独立
alphabet = {
    "Ipk",  # 基础知识类提问(Ipk)
    "Pk",  # 基础知识类回应(Pk)
    "Ipi",  # 个人观点类提问(Ipi)
    "Pi",  # 个人观点类回应(Pi)
    "Ia",  # 分析阐释式提问(Ia)
    "An",  # 分析阐释式回应(An)
    "Ic",  # 总结归纳式提问(Ic)
    "Co",  # 总结归纳式回应(Co)
    "Is",  # 迁移创新式提问(Is)
    "Sp",  # 迁移创新式回应(Sp)
    "Iu",  # 回应建构式提问(Iu) - 仅Ia→An或Ic→Co之后
    "Up",  # 回应建构式回应(Up)
    "Ag",  # 认同(Ag)
    "Qu",  # 质疑(Qu)
    "Gu",  # 指导(Gu)
}
states = {"q0", "q1", "q2", "q3", "q4", "q5", "q6", "q7", "q8"}
transitions = {
    "q0": {
        "Ipk": ["q1"],
        "Ipi": ["q2"],
        "Ia": ["q3"],
        "Is": ["q4"],
        "Ic": ["q6"],
        "Gu": ["q0"],
        "Qu": ["q0"],
    },
    "q1": {
        "Gu": ["q1"],
        "Pk": ["q7", "q0"],
    },
    "q2": {
        "Gu": ["q2"],
        "Pi": ["q7", "q0"],
        "Ia": ["q3"],
    },
    "q3": {
        "Gu": ["q3"],
        "An": ["q7", "q0"],
        "Iu": ["q5"],
        "Ic": ["q6"],
    },
    "q4": {
        "Gu": ["q4"],
        "Sp": ["q7", "q0"],
    },
    "q5": {
        "Gu": ["q5"],
        "Up": ["q7", "q0"],
    },
    "q6": {
        "Gu": ["q6"],
        "Co": ["q7", "q0"],
        "Iu": ["q5"],
    },
    "q7": {
        "Ag": ["q8"],
        "Qu": ["q7"],
        "Iu": ["q5"],
    },
    "q8": {
        "Ag": ["q0"],
    },
}
start_state = "q0"
accept_states = {"q8"}
